Catalogs/ШаблоныHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ШаблоныHTML</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткудаБылЗагружен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличныйДокумент</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныHTML/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТекстовыйДокументПриИзменении(Элемент)
	Объект.ТекстШаблона = ТекстовыйДокумент.ПолучитьТекст();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьШаблон(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = Объект.ОткудаБылЗагружен; 
	Диалог.Фильтр = "HTM (*.htm)|*.htm|HTML (*.html)|*.html"; 
	Диалог.МножественныйВыбор = Ложь;
	//Диалог.Каталог = "F:\";
	Если Диалог.Выбрать() Тогда
		Объект.ОткудаБылЗагружен = Диалог.ПолноеИмяФайла;
		ТекстовыйДокумент.Прочитать(Диалог.ПолноеИмяФайла);
		Объект.ТекстШаблона = ТекстовыйДокумент.ПолучитьТекст();		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьШаблон(Команда)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = Объект.ОткудаБылЗагружен; 
	Диалог.Фильтр = "HTM (*.htm)|*.htm|HTML (*.html)|*.html"; 
	Диалог.МножественныйВыбор = Ложь;
	//Диалог.Каталог = "F:\";
	Если Диалог.Выбрать() Тогда
		ТекстовыйДокумент.Записать(Диалог.ПолноеИмяФайла);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	#Если Вебклиент Тогда
		Сообщить("Данный функционал не доступен на Веб-клиенте!");
		Отказ = Истина;
	#Иначе
		ТекстовыйДокумент.УстановитьТекст(Объект.ТекстШаблона);
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ИмпортШаблона(Команда)
	#Если Вебклиент Тогда
		Сообщить("Данный функционал не доступен на Веб-клиенте!");
	#Иначе
		ИмяФайла = ПолучитьИмяВременногоФайла();
		ТабличныйДокумент.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.HTML);
		
		Объект.ОткудаБылЗагружен = "";
		ТекстовыйДокумент.Прочитать(ИмяФайла);
		Объект.ТекстШаблона = ТекстовыйДокумент.ПолучитьТекст();
		
		УдалитьФайлы(ИмяФайла);
	#КонецЕсли
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	ЭлементОбъект = РеквизитФормыВЗначение("Объект");
	ТабличныйДокумент = ЭлементОбъект.ВернутьСодержимоеХранилища();
	ЗначениеВРеквизитФормы(ЭлементОбъект, "Объект");   
	ДекорацияТег = "Внимание!";
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "</TR>", "</tr>");
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "</Tr>", "</tr>");
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "</tR>", "</tr>");
	
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "<TR>", "<tr >");
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "<Tr>", "<tr >");
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "<tR>", "<tr >");
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "<tr>", "<tr >");
	
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "<TR ", "<tr ");
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "<Tr ", "<tr ");
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "<tR ", "<tr ");
	
	Объект.ТекстШаблона = СтрЗаменить(Объект.ТекстШаблона, "</HTML>", "</html>");
	
	ПоместитьВХранилищеДанные();
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилищеДанные()
	ЭлементОбъект = РеквизитФормыВЗначение("Объект");                  
	ЭлементОбъект.ЗаписатьСодержимоеХранилища(ТабличныйДокумент);
	ЭлементОбъект.Записать();
	ЗначениеВРеквизитФормы(ЭлементОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ОбъединитьЯчейки(Команда)
	ТабличныйДокумент.ТекущаяОбласть.Объединить();
КонецПроцедуры
